[{
  "_id": {
    "$oid": "670d35895ee0e7fe4c6d9e73"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Prince Siren",
      "role": "In the Shark Kingdom, Prince Siren’s family has ruled for many years. There is a prophecy that determines what shall become of his kingdom – To save his people from a curse, he must kill the beacon. Throughout the story, internal conflicts are the main events in Siren’s life. On one hand, he feels responsible for his people’s lives as a Prince; on the other hand, he is unable to kill an innocent. The relationship between Siren and Kappa is a significant aspect of the Castle Swimmer webtoon. While initially believing that Kappa could break the curse, their meeting turns out to be about something beyond saving lives. Although Siren goes through major changes in character development throughout the story, he begins as an obedient prince who questions whether or not fate alone should decide one’s life path.",
      "_id": {
        "$oid": "670d35895ee0e7fe4c6d9e74"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d35ce5ee0e7fe4c6d9e78"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Kappa",
      "role": "Kappa, or ‘The Beacon,’ is the primary protagonist of Wendy Lian Martin’s webtoon Castle Swimmer. He needs to fulfill various prophecies that are said to bring luck or salvation. Being a beacon signifies being a savior who provides light for people’s lives, even though he has to sacrifice his desires.Kindness, compassion, and a sense of duty describe Kappa above everything else. He still holds sympathy for others despite having heavy responsibilities laid upon him since birth, making him one of the best Castle Swimmer characters. But he also feels lonely and unable to control his life. In the narrative, Kappa’s most significant relationship is with Siren, the prince of the Shark Kingdom. However, their bond is complicated by a prophecy claiming Prince Siren is supposed to kill Kappa to save his people. Nevertheless, this prophecy does not prevent them from building a bond that will gradually transform into love. ",
      "_id": {
        "$oid": "670d35ce5ee0e7fe4c6d9e79"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d35f95ee0e7fe4c6d9e7b"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Top Castle Swimmer Characters: Susca",
      "role": "Susca is the reigning monarch in the Shark Kingdom who plays a significant role in this narrative, especially in Siren’s life. Her sharp teeth and fins make her look like a shark, emphasizing her authority and power. This also means that she will go to any lengths to protect her people, even if it means causing death and havoc. Her hardworking attitude can also be interpreted as an excessive sticking to something, especially when it is about Siren fulfilling his destiny as the curse breaker. The relationship between Prince Siren and Queen Susca lies at the heart of this tale, with tension arising from loving one’s child against obligations as a mother. ",
      "_id": {
        "$oid": "670d35f95ee0e7fe4c6d9e7c"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36225ee0e7fe4c6d9e7e"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Skiff",
      "role": "An obedient sentry, Skiff is in line to become the next king. He feels a deep commitment to his citizens and the duties bestowed upon him. This quality makes him dependable and credible, devoted to caring for others around him. He is accountable, thoughtful, and genuinely concerned about his people’s well-being. As soon-to-be king, Skiff probably has mentors who are helping him develop into a leader. These associations helped mold his understanding of leading and what it means to one day become a king himself. Throughout the series, Skiff undergoes significant character development. ",
      "_id": {
        "$oid": "670d36225ee0e7fe4c6d9e7f"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36515ee0e7fe4c6d9e81"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Queen Nethimir",
      "role": "Queen Nethimir plays an essential role in the Castle Swimmer webtoon as the ruler of the last three Octalia. She is depicted as a wise, strong ruler commanding loyalty from her subjects, including her people’s respect for her leadership traits. Her tremendous guts are shown by her unwavering determination to save people under her rule. She has an overwhelming sense of responsibility, which she carries with a deep understanding of her obligation, putting her kingdom before herself.The connection between Queen Nethimir and Kappa is quite interesting. She looked at him with a curious eye as if she had found the answer to the riddle of their lives. Most of Kappa’s journey is inspired by her words and ideas. As a result, Queen Nethimir’s decisions and actions are crucial for the whole plot. ",
      "_id": {
        "$oid": "670d36515ee0e7fe4c6d9e82"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36725ee0e7fe4c6d9e84"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Shoal",
      "role": "Shoal is Siren’s father and Susca’s husband. His personality is characterized by strength coupled with wisdom plus sympathy. His role as a father towards his son shows deep concern about preparing him to face future challenges. The companionship between Shoal and Susca is based on mutual understanding and respect for one another. More than all, he sacrificed his personal interests for his family or subjects, taking up leadership responsibly. This attribute alone makes him respectable as well as a likable character that beautifies world-building and landscapes from an emotional perspective.",
      "_id": {
        "$oid": "670d36725ee0e7fe4c6d9e85"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d369b5ee0e7fe4c6d9e87"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": " Top Castle Swimmer Characters: Queen Nee",
      "role": "Queen Nee, the queen of the NeedleNee mers, is characterized as a striking and complex figure. She thinks strategically, always considering the effects of her actions. Notwithstanding this, she remains easy to approach and sympathetic, earning her people’s love and respect. Queen Nee’s character is one of the most important Castle Swimmer characters because the choices she makes will determine what lies ahead for their kingdom vis-a-vis other tribes of Merfolk that they may come across.She represents leadership at its finest – solid and caring, too. Her character demonstrates that true power lies not in physical force but in showing mercy, doing justice, and being unreservedly committed to one’s own people. This journey again serves as a reminder to readers about how intricate it can be when you have a monarchy.",
      "_id": {
        "$oid": "670d369b5ee0e7fe4c6d9e88"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36ba5ee0e7fe4c6d9e8a"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": " Selkie",
      "role": "Elder Selkie exercises authority over all the people living in Shark Castle. She embodies wisdom and experience, often providing sage advice to others. She is old and, therefore, familiar with Shark Castle’s history; thus, her knowledge comes in handy when any need arises. Selkie’s role is substantial since she builds a bridge between the old knowledge and new emerging obstacles. Unfortunately, some other Castle Swimmer characters doubt her predictions, accusing her of being foolish. Such misunderstandings create tension, thus making it attractive as characters try to balance their beliefs and expectations of society. to one’s own people. This journey again serves as a reminder to readers about how intricate it can be when you have a monarchy.",
      "_id": {
        "$oid": "670d36ba5ee0e7fe4c6d9e8b"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36dc5ee0e7fe4c6d9e8d"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Galoo",
      "role": "Gallo plays a vital role as custodian of the Sacred Ground. As a Mer most crucial duty is to ensure that anyone who wants to come into Sanctuary should bear a pure heart. This role holds great significance, given the importance of the Sanctuary and the potential threats it faces. However, what makes them unique is their ability to feel or go through other men’s memories. This exceptional power enables them to know people’s real intentions, thus allowing only those who are worthy to access inside of the Sanctuary. They bring an air of mystery and importance around the Sanctuary, indicating that it is a place where one can find refuge but with the highest measures taken.",
      "_id": {
        "$oid": "670d36dc5ee0e7fe4c6d9e8e"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d36fe5ee0e7fe4c6d9e90"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Mucku",
      "role": "Mucku is an important character as she has been leading the last three Octalias. She exhibits significant self-confidence and her physical characteristics reflect her power and dominance, making her an unforgettable and impressive personality. Her choices and acts have profound implications for the ongoing events, making her one of the central Castle Swimmer characters in the overarching narrative.",
      "_id": {
        "$oid": "670d36fe5ee0e7fe4c6d9e91"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d37215ee0e7fe4c6d9e93"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Top Castle Swimmer Characters: Silver",
      "role": "Silver is a former guard who once worked at Shark Castle. She also happens to be an ex-soldier who can’t swim without assistance and has numerous wounds, including losing both eyes, caudal fin, and left little finger, accompanied by extensive damage to her right ear. Silver has short, spiky, dark blue hair and is wearing a brownish rag around her chest. She always tries to cheer up everyone around her with her happy-go-lucky and positive-minded attitude. Silver’s status as a guardian, combined with her personal difficulties, set off against Shark Castle’s more traditional underwater capabilities.",
      "_id": {
        "$oid": "670d37215ee0e7fe4c6d9e94"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d37475ee0e7fe4c6d9e96"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Orakos",
      "role": "Orakos desperately wants the Beacon as he believes he will save lives in his world. His search for Beacon reflects his sense of mission and desire for something specific concerning prophecies. By nature, Orakos is always firm and purposeful, with an indomitable spirit of fulfillment. His interactions with others significantly contribute to plot development, particularly considering the conflict and dynamics within the underwater society. Therefore, Orakos’ quest for the Beacon establishes a sense of urgency and suspense in the story, identifying him as one of the key Castle Swimmer characters responsible for uncovering more profound layers of the series.",
      "_id": {
        "$oid": "670d37475ee0e7fe4c6d9e97"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d376f5ee0e7fe4c6d9e99"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Monos",
      "role": "Mono leads the three last Octalia survivors from the Octalia. She has unique tentacle-like features that distinguish her from other characters. Her design shows how majestic they are since she combines strength with gracefulness. Mono’s leadership becomes crucial in different conflicts throughout the Castle Swimmer webtoon. She makes decisions with massive bearings, especially concerning their doom or triumphs and relationships with other characters. Thus, she contributes to the narrative by illuminating some aspects of the struggles faced by Octalia through their navigation in a complex world.",
      "_id": {
        "$oid": "670d376f5ee0e7fe4c6d9e9a"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d37955ee0e7fe4c6d9e9c"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Top Castle Swimmer Characters: Herm",
      "role": "Herm is a Mer Hermit Crab with a unique crab shell that he has adjusted to hold his extensive collection of scrolls and historical artifacts. He displays a strong interest in history and is known for being a curious individual. His love for ancient scrolls and knowledge drives much of the narrative story. With profound intellect, he comes across as somewhat unsocial. Thus, it is an essential source of background information on past events and their enigmas for characters in the play. He is friends with Siren’s Fathe Shoa.The presence of dynamic Castle Swimmer characters enriches its plotline and adds layers of complexity to it. Every single one, from Kappa’s brave journey to Skiff showing ultimate loyalty, is fundamental to shaping the narrative at large. Let us know your thoughts on the Castle Swimmer webtoon in the comments below.",
      "_id": {
        "$oid": "670d37955ee0e7fe4c6d9e9d"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d38195ee0e7fe4c6d9eae"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Top Castle Swimmer Characters: Herm",
      "role": "Herm is a Mer Hermit Crab with a unique crab shell that he has adjusted to hold his extensive collection of scrolls and historical artifacts. He displays a strong interest in history and is known for being a curious individual. His love for ancient scrolls and knowledge drives much of the narrative story. With profound intellect, he comes across as somewhat unsocial. Thus, it is an essential source of background information on past events and their enigmas for characters in the play. He is friends with Siren’s Fathe Shoa.The presence of dynamic Castle Swimmer characters enriches its plotline and adds layers of complexity to it. Every single one, from Kappa’s brave journey to Skiff showing ultimate loyalty, is fundamental to shaping the narrative at large. Let us know your thoughts on the Castle Swimmer webtoon in the comments below.",
      "_id": {
        "$oid": "670d38195ee0e7fe4c6d9eaf"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d38735ee0e7fe4c6d9ec1"
  },
  "title": "Webtoons",
  "description": "Welcome",
  "characters": [
    {
      "name": "Top Castle Swimmer Characters: Herm",
      "role": "Herm is a Mer Hermit Crab with a unique crab shell that he has adjusted to hold his extensive collection of scrolls and historical artifacts. He displays a strong interest in history and is known for being a curious individual. His love for ancient scrolls and knowledge drives much of the narrative story. With profound intellect, he comes across as somewhat unsocial. Thus, it is an essential source of background information on past events and their enigmas for characters in the play. He is friends with Siren’s Fathe Shoa.The presence of dynamic Castle Swimmer characters enriches its plotline and adds layers of complexity to it. Every single one, from Kappa’s brave journey to Skiff showing ultimate loyalty, is fundamental to shaping the narrative at large. Let us know your thoughts on the Castle Swimmer webtoon in the comments below.",
      "_id": {
        "$oid": "670d38735ee0e7fe4c6d9ec2"
      }
    }
  ],
  "__v": 0
},
{
  "_id": {
    "$oid": "670d3c785ee0e7fe4c6d9ee9"
  },
  "title": "Webtoons",
  "description": "Webtoons characters",
  "characters": [
    {
      "name": "Top Notch",
      "role": "Top Notch is a Mer Hermit Crab with a unique crab shell that he has adjusted to hold his extensive collection of scrolls and historical artifacts. He displays a strong interest in history and is known for being a curious individual. His love for ancient scrolls and knowledge drives much of the narrative story. With profound intellect, he comes across as somewhat unsocial. Thus, it is an essential source of background information on past events and their enigmas for characters in the play. He is friends with Siren’s Fathe Shoa.The presence of dynamic Castle Swimmer characters enriches its plotline and adds layers of complexity to it. Every single one, from Kappa’s brave journey to Skiff showing ultimate loyalty, is fundamental to shaping the narrative at large. Let us know your thoughts on the Castle Swimmer webtoon in the comments below.",
      "_id": {
        "$oid": "670d3c785ee0e7fe4c6d9eea"
      }
    }
  ],
  "__v": 0
}]